csvimplementation.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">50</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">C:/VishuOffice/apache-jmeter-5.6.3/apache-jmeter-5.6.3/bin/Notes- Performance Automation Jmeter/testdata.csv</stringProp>
          <boolProp name="ignoreFirstLine">false</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">keywords</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <boolProp name="HTTPSampler.image_parser">true</boolProp>
          <stringProp name="HTTPSampler.domain">www.google.com</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/search?q=${keywords}&amp;sca_esv=7c704608065062ea&amp;rlz=1C1YTUH_enIN1084IN1084&amp;ei=cZgAZ_SDDJGKseMP5c6l2QM&amp;ved=0ahUKEwi0gNWwjfaIAxURRWwGHWVnKTsQ4dUDCA8&amp;uact=5&amp;oq=shirts&amp;gs_lp=Egxnd3Mtd2l6LXNlcnAiBnNoaXJ0czIIEAAYgAQYsQMyCBAAGIAEGLEDMgsQABiABBixAxiDATIIEAAYgAQYsQMyBRAAGIAEMggQABiABBixAzIFEAAYgAQyBRAAGIAEMgUQABiABDILEAAYgAQYsQMYgwFIt5sCUJCQAVj0ogFwA3gBkAEAmAH1AaABwAiqAQUwLjQuMrgBA8gBAPgBAZgCCaAC7wmoAhTCAgoQABiwAxjWBBhHwgINEAAYgAQYsAMYQxiKBcICExAuGIAEGLADGEMYyAMYigXYAQHCAhMQABiABBhDGLQCGIoFGOoC2AEBwgITEC4YgAQYQxi0AhiKBRjqAtgBAcICFBAAGIAEGOMEGLQCGOkEGOoC2AEBwgIWEAAYAxi0AhjlAhjqAhiMAxiPAdgBAsICFhAuGAMYtAIY5QIY6gIYjAMYjwHYAQLCAhEQLhiABBixAxjRAxiDARjHAcICCBAuGIAEGLEDwgIOEAAYgAQYsQMYgwEYigXCAhAQLhiABBjRAxhDGMcBGIoFwgINEAAYgAQYsQMYQxiKBcICEBAAGIAEGLEDGEMYgwEYigXCAgoQABiABBhDGIoFwgIOEC4YgAQYsQMYgwEYigXCAh8QLhiABBjRAxhDGMcBGIoFGJcFGNwEGN4EGOAE2AECwgINEC4YgAQYsQMYQxiKBcICChAuGIAEGEMYigXCAhAQLhiABBixAxhDGIMBGIoFmANTiAYBkAYMugYECAEYCLoGBggCEAEYCpIHBTMuNC4yoAfyUw&amp;sclient=gws-wiz-serp</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="authority" elementType="Header">
                <stringProp name="Header.name">authority</stringProp>
                <stringProp name="Header.value">www.google.com</stringProp>
              </elementProp>
              <elementProp name="method" elementType="Header">
                <stringProp name="Header.name">method</stringProp>
                <stringProp name="Header.value">GET</stringProp>
              </elementProp>
              <elementProp name="path" elementType="Header">
                <stringProp name="Header.name">path</stringProp>
                <stringProp name="Header.value">/search?q=shirts&amp;sca_esv=7c704608065062ea&amp;rlz=1C1YTUH_enIN1084IN1084&amp;ei=cZgAZ_SDDJGKseMP5c6l2QM&amp;ved=0ahUKEwi0gNWwjfaIAxURRWwGHWVnKTsQ4dUDCA8&amp;uact=5&amp;oq=shirts&amp;gs_lp=Egxnd3Mtd2l6LXNlcnAiBnNoaXJ0czIIEAAYgAQYsQMyCBAAGIAEGLEDMgsQABiABBixAxiDATIIEAAYgAQYsQMyBRAAGIAEMggQABiABBixAzIFEAAYgAQyBRAAGIAEMgUQABiABDILEAAYgAQYsQMYgwFIt5sCUJCQAVj0ogFwA3gBkAEAmAH1AaABwAiqAQUwLjQuMrgBA8gBAPgBAZgCCaAC7wmoAhTCAgoQABiwAxjWBBhHwgINEAAYgAQYsAMYQxiKBcICExAuGIAEGLADGEMYyAMYigXYAQHCAhMQABiABBhDGLQCGIoFGOoC2AEBwgITEC4YgAQYQxi0AhiKBRjqAtgBAcICFBAAGIAEGOMEGLQCGOkEGOoC2AEBwgIWEAAYAxi0AhjlAhjqAhiMAxiPAdgBAsICFhAuGAMYtAIY5QIY6gIYjAMYjwHYAQLCAhEQLhiABBixAxjRAxiDARjHAcICCBAuGIAEGLEDwgIOEAAYgAQYsQMYgwEYigXCAhAQLhiABBjRAxhDGMcBGIoFwgINEAAYgAQYsQMYQxiKBcICEBAAGIAEGLEDGEMYgwEYigXCAgoQABiABBhDGIoFwgIOEC4YgAQYsQMYgwEYigXCAh8QLhiABBjRAxhDGMcBGIoFGJcFGNwEGN4EGOAE2AECwgINEC4YgAQYsQMYQxiKBcICChAuGIAEGEMYigXCAhAQLhiABBixAxhDGIMBGIoFmANTiAYBkAYMugYECAEYCLoGBggCEAEYCpIHBTMuNC4yoAfyUw&amp;sclient=gws-wiz-serp</stringProp>
              </elementProp>
              <elementProp name="accept" elementType="Header">
                <stringProp name="Header.name">accept</stringProp>
                <stringProp name="Header.value">text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7</stringProp>
              </elementProp>
              <elementProp name="accept-encoding" elementType="Header">
                <stringProp name="Header.name">accept-encoding</stringProp>
                <stringProp name="Header.value">gzip, deflate, br, zstd</stringProp>
              </elementProp>
              <elementProp name="accept-language" elementType="Header">
                <stringProp name="Header.name">accept-language</stringProp>
                <stringProp name="Header.value">en-US,en;q=0.9</stringProp>
              </elementProp>
              <elementProp name="cache-control" elementType="Header">
                <stringProp name="Header.name">cache-control</stringProp>
                <stringProp name="Header.value">no-cache</stringProp>
              </elementProp>
              <elementProp name="cookie" elementType="Header">
                <stringProp name="Header.name">cookie</stringProp>
                <stringProp name="Header.value">SID=g.a000ogieh89XcIlPPSkGpHwoQP0FRs6gUldXyx_a46joAdnP0iOeL2bVNvAdivms6a1j9_unkAACgYKAQoSARcSFQHGX2MimrPb6mhyz1zahFNbQg5dixoVAUF8yKrJF8VhG1rPLmi285EwbA9r0076; __Secure-1PSID=g.a000ogieh89XcIlPPSkGpHwoQP0FRs6gUldXyx_a46joAdnP0iOeTQRUaBLiOeVnTuOcKh1IYQACgYKAR4SARcSFQHGX2MiWSRYU_T2W99EbLWA8MuR4hoVAUF8yKpFamc_Jpr5a_wkUJ9J1nP10076; __Secure-3PSID=g.a000ogieh89XcIlPPSkGpHwoQP0FRs6gUldXyx_a46joAdnP0iOey0udnRNEtq7VhaqHUYnkfwACgYKAWYSARcSFQHGX2Mi7aFmQ4m_7YV58TUV1IxjghoVAUF8yKpP0sShsiwGzl5CN17hneTY0076; HSID=AjPDfKQvmxqjExsem; SSID=AUBMPvv-k-EMbFMAe; APISID=FX6vN4xGnWOTIXu7/AOSZ523hZnMXCnt9N; SAPISID=hCzPBs52F8EwCYLN/A6RocMo2AOc2Q84Y8; __Secure-1PAPISID=hCzPBs52F8EwCYLN/A6RocMo2AOc2Q84Y8; __Secure-3PAPISID=hCzPBs52F8EwCYLN/A6RocMo2AOc2Q84Y8; __Secure-1PSIDTS=sidts-CjEBQlrA-PItPOagWm8nYMrjDH4a_O-RCscYx4tQ2FM5YkS5hE-Vug3ybXrqLHrAR9TQEAA; __Secure-3PSIDTS=sidts-CjEBQlrA-PItPOagWm8nYMrjDH4a_O-RCscYx4tQ2FM5YkS5hE-Vug3ybXrqLHrAR9TQEAA; AEC=AVYB7coNCjxOhqhMO9uOtNLkHZffW-U24FnEKpjP3KoiGW7-NSDL6OFWjw; NID=518=q9uekH06RCOCa3pxNcHtdYa-xxZ9v8sxTYhMTFDRBOAhrhAqKeFyfQdQYduMvu5Kbdbt7Kg0x-Ycr9uTYf0Wg9YRDBMnDU-snLe3cPU37ZgTEJ-EhvVs_cVl4qYPfWqkfLoFgPtlQxpA20ITqHQmdLr1gOffuCgf2wA_0cuRgJyxyAXpf7AMpHbHIkztzSuiC95xenMo0Shbx9oEOL0epMkmeyz7DzTR9G-ZdUvBr-ZH8D59Yx1o8Zxg80tyNndzPnMfImADp_5eRxS-vjk2KEQXQZ0_1Dq3RC0O5todj7lYohwRKND5VSAo8Wx409Fu5S4yuvKUI22guYvIy3hP9wr1JA5u6zKsvkvoK4K3NwvRwTG59mLFIAXrF1si3yu9oglmbSneWLT9dUR778RaVQD_bjs9wtBSMp4LoFdHAqAp3xweyDIQYfFdks3bA2wD0ujTJV3ru3919Wu3pfzQtaRrbGtKuXq_G7dVdWyDMAM4srQ7A1lwuiEOUMfq1S09V9dqXPmHAeU15nqSddHfIYrKxQHkpNDki3gdAYtqEBhSzrEIFrWIN-ouAsLadf6i1rxF4CjamHvlbuOXb1cJO_Iso5EKeP53rXByLbdVvklZUG5Jbe4-zJhO6NjoiNVao8pXk8SrysKoaRiisjqOCJmdzRiUw3iQxE2-HBYEFuR0pyE-W9jxo0agBij6d96jHnW1nOcC1KOl9GxPoGH4ljCFMfnSWwExvuDRrTgFiwL0aCpXaEkseGfOj0HuV4w1AlyF5jEeIi9uK5F__EVBuXpNZxXuCO3hnUYhAe0tJD5mS8Bq5KbJHlxd-tuDrg7PgQYWPbtDTOjoMRoNNVbp2VAsym24IxWosrEYgga4X2gLoHwWpBm5Sot5HMPJ7sbzFGFiJgBOFciZnLnMZI1sb2mXvm9qV2W1k1LnLR2f-rpN4mb1lOexqFJ5gBC-mKaJzzOoKL9ycKunX-doCTr18-cEP_NQUkNDK9avGKqOF7wemL977sWOJz8l9uPeld7zFucULBVUbPuQUdduB8uL9QWgZgf82DUkgb48gZf7ebGVVjmMyF8BhFoxiefGwvYz6ISQwrZhXl6zSQ; DV=s77271tKfBEg0KXi2U5DAWKhujelJdljFs55AWIZ-AMAAAA; UULE=a+cm9sZTogMQpwcm9kdWNlcjogMTIKdGltZXN0YW1wOiAxNzI4MDkyMjcxMTI4MDAwCmxhdGxuZyB7CiAgbGF0aXR1ZGVfZTc6IDI4NDMyNzkzNgogIGxvbmdpdHVkZV9lNzogNzcwNzAzMzYwCn0KcmFkaXVzOiA0NzYyNDg2NTkuNDU2NTY0MDcKcHJvdmVuYW5jZTogNgo=; SIDCC=AKEyXzVVu-KPp7TGmzcnWXQDB6yYX9kzi54uf-0-t6voWQ3AzkaBQhit0qiJ5kWB0HWWdEnE3Q; __Secure-1PSIDCC=AKEyXzUcMA7GYtlsvqWhyXQ9B5XYJ6d-PmWbIq8-XpDWhq7ethuaXq7QaAYXAX52BAVPFvVKRw; __Secure-3PSIDCC=AKEyXzVV-MgkX3dVC1hAP3Ipmq580QByYuq3poDKKCg5OPOuHpdpiiGSGmP0Bd87iPSW62saKQ</stringProp>
              </elementProp>
              <elementProp name="pragma" elementType="Header">
                <stringProp name="Header.name">pragma</stringProp>
                <stringProp name="Header.value">no-cache</stringProp>
              </elementProp>
              <elementProp name="priority" elementType="Header">
                <stringProp name="Header.name">priority</stringProp>
                <stringProp name="Header.value">u=0, i</stringProp>
              </elementProp>
              <elementProp name="referer" elementType="Header">
                <stringProp name="Header.name">referer</stringProp>
                <stringProp name="Header.value">https://www.google.com/</stringProp>
              </elementProp>
              <elementProp name="sec-ch-prefers-color-scheme" elementType="Header">
                <stringProp name="Header.name">sec-ch-prefers-color-scheme</stringProp>
                <stringProp name="Header.value">dark</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua</stringProp>
                <stringProp name="Header.value">&quot;Google Chrome&quot;;v=&quot;129&quot;, &quot;Not=A?Brand&quot;;v=&quot;8&quot;, &quot;Chromium&quot;;v=&quot;129&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-arch" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-arch</stringProp>
                <stringProp name="Header.value">&quot;x86&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-bitness" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-bitness</stringProp>
                <stringProp name="Header.value">&quot;64&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-form-factors" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-form-factors</stringProp>
                <stringProp name="Header.value">&quot;Desktop&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-full-version" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-full-version</stringProp>
                <stringProp name="Header.value">&quot;129.0.6668.70&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-full-version-list" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-full-version-list</stringProp>
                <stringProp name="Header.value">&quot;Google Chrome&quot;;v=&quot;129.0.6668.70&quot;, &quot;Not=A?Brand&quot;;v=&quot;8.0.0.0&quot;, &quot;Chromium&quot;;v=&quot;129.0.6668.70&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-mobile" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-mobile</stringProp>
                <stringProp name="Header.value">?0</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-model" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-model</stringProp>
                <stringProp name="Header.value">&quot;&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-platform" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-platform</stringProp>
                <stringProp name="Header.value">&quot;Windows&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-platform-version" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-platform-version</stringProp>
                <stringProp name="Header.value">&quot;15.0.0&quot;</stringProp>
              </elementProp>
              <elementProp name="sec-ch-ua-wow64" elementType="Header">
                <stringProp name="Header.name">sec-ch-ua-wow64</stringProp>
                <stringProp name="Header.value">?0</stringProp>
              </elementProp>
              <elementProp name="sec-fetch-dest" elementType="Header">
                <stringProp name="Header.name">sec-fetch-dest</stringProp>
                <stringProp name="Header.value">document</stringProp>
              </elementProp>
              <elementProp name="sec-fetch-mode" elementType="Header">
                <stringProp name="Header.name">sec-fetch-mode</stringProp>
                <stringProp name="Header.value">navigate</stringProp>
              </elementProp>
              <elementProp name="sec-fetch-site" elementType="Header">
                <stringProp name="Header.name">sec-fetch-site</stringProp>
                <stringProp name="Header.value">same-origin</stringProp>
              </elementProp>
              <elementProp name="sec-fetch-user" elementType="Header">
                <stringProp name="Header.name">sec-fetch-user</stringProp>
                <stringProp name="Header.value">?1</stringProp>
              </elementProp>
              <elementProp name="upgrade-insecure-requests" elementType="Header">
                <stringProp name="Header.name">upgrade-insecure-requests</stringProp>
                <stringProp name="Header.value">1</stringProp>
              </elementProp>
              <elementProp name="user-agent" elementType="Header">
                <stringProp name="Header.name">user-agent</stringProp>
                <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/129.0.0.0 Safari/537.36</stringProp>
              </elementProp>
              <elementProp name="x-browser-channel" elementType="Header">
                <stringProp name="Header.name">x-browser-channel</stringProp>
                <stringProp name="Header.value">stable</stringProp>
              </elementProp>
              <elementProp name="x-browser-copyright" elementType="Header">
                <stringProp name="Header.name">x-browser-copyright</stringProp>
                <stringProp name="Header.value">Copyright 2024 Google LLC. All rights reserved.</stringProp>
              </elementProp>
              <elementProp name="x-browser-validation" elementType="Header">
                <stringProp name="Header.name">x-browser-validation</stringProp>
                <stringProp name="Header.value">g+9zsjnuPhmKvFM5e6eaEzcB1JY=</stringProp>
              </elementProp>
              <elementProp name="x-browser-year" elementType="Header">
                <stringProp name="Header.name">x-browser-year</stringProp>
                <stringProp name="Header.value">2024</stringProp>
              </elementProp>
              <elementProp name="x-client-data" elementType="Header">
                <stringProp name="Header.name">x-client-data</stringProp>
                <stringProp name="Header.value">CI22yQEIorbJAQipncoBCMaXywEIlKHLAQiFoM0BCP2lzgEIxbbOAQigu84BCNy+zgEI+sDOAQi8xM4BCMvEzgEIk8bOARjs080BGJ2xzgEYxL3OAQ==</stringProp>
              </elementProp>
              <elementProp name="Decoded" elementType="Header">
                <stringProp name="Header.name">Decoded</stringProp>
                <stringProp name="Header.value">message ClientVariations {</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>